###############################################################################
# Created by write_sdc
# Thu Jun  9 03:36:14 2022
###############################################################################
current_design natalius_soc
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {addr0[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din0[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {din[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_cyc_i}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wbs_stb_i}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {web}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wmask0[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {wmask0[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {b}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout0[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {dout[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {hs}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {io_oeb[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {r}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {vs}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {b}]
set_load -pin_load 0.0334 [get_ports {g}]
set_load -pin_load 0.0334 [get_ports {hs}]
set_load -pin_load 0.0334 [get_ports {r}]
set_load -pin_load 0.0334 [get_ports {vs}]
set_load -pin_load 0.0334 [get_ports {dout[7]}]
set_load -pin_load 0.0334 [get_ports {dout[6]}]
set_load -pin_load 0.0334 [get_ports {dout[5]}]
set_load -pin_load 0.0334 [get_ports {dout[4]}]
set_load -pin_load 0.0334 [get_ports {dout[3]}]
set_load -pin_load 0.0334 [get_ports {dout[2]}]
set_load -pin_load 0.0334 [get_ports {dout[1]}]
set_load -pin_load 0.0334 [get_ports {dout[0]}]
set_load -pin_load 0.0334 [get_ports {dout0[15]}]
set_load -pin_load 0.0334 [get_ports {dout0[14]}]
set_load -pin_load 0.0334 [get_ports {dout0[13]}]
set_load -pin_load 0.0334 [get_ports {dout0[12]}]
set_load -pin_load 0.0334 [get_ports {dout0[11]}]
set_load -pin_load 0.0334 [get_ports {dout0[10]}]
set_load -pin_load 0.0334 [get_ports {dout0[9]}]
set_load -pin_load 0.0334 [get_ports {dout0[8]}]
set_load -pin_load 0.0334 [get_ports {dout0[7]}]
set_load -pin_load 0.0334 [get_ports {dout0[6]}]
set_load -pin_load 0.0334 [get_ports {dout0[5]}]
set_load -pin_load 0.0334 [get_ports {dout0[4]}]
set_load -pin_load 0.0334 [get_ports {dout0[3]}]
set_load -pin_load 0.0334 [get_ports {dout0[2]}]
set_load -pin_load 0.0334 [get_ports {dout0[1]}]
set_load -pin_load 0.0334 [get_ports {dout0[0]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[20]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[19]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[18]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[17]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[16]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[15]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[14]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[13]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[12]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[11]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[10]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[9]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[8]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[7]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[6]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[5]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[4]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[3]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[2]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[1]}]
set_load -pin_load 0.0334 [get_ports {io_oeb[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_cyc_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wbs_stb_i}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {web}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {addr0[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {din0[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wmask0[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {wmask0[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 5.0000 [current_design]
